lad1337/esp-hole/generator-node/sdkconfig.defaults
# Generator-node firmware: ESP32-P4-Function-EV-Board, onboard IP101 RMII
# PHY (see main/idf_component.yml + Kconfig.projbuild defaults), 32 MB PSRAM,
# 32 MB flash. Separate ESP-IDF project from the sinkhole firmware (../) —
# see CLAUDE.md's "Firmware roles" section for why.
CONFIG_IDF_TARGET="esp32p4"

# Same pre-mass-production-silicon workaround as the sinkhole build (rev
# v1.3 board; IDF's default REV_MIN is v3.1). Drop back to the IDF default if
# this ever runs on rev3+ silicon.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y

CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Panic (and therefore reboot) rather than hang if anything faults.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y

# HTTPS fetch from public blocklist sources (GitHub-raw, oisd.nl, …) needs the
# full CA bundle — more host diversity than the sinkhole's single manifest
# host, so keep the default (full) bundle rather than trimming it.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# HTTP server: manifest.json/blocklist.bin/healthz/refresh/stats. Port 80 so
# a plain http://<node-ip>/manifest.json works with no port in the URL.
CONFIG_GENERATOR_HTTP_PORT=80

# Best-effort UDP node-stats collector + GET /stats, /stats/ui/ — see
# main/stats.c and generator-node/main/stats_ui.c. Point sinkhole nodes'
# CONFIG_SINKHOLE_STATS_HOST at this node's IP to feed it.
CONFIG_GENERATOR_STATS_ENABLE=y
CONFIG_GENERATOR_STATS_PORT=8094

# CONFIG_GENERATOR_ALLOWLIST is intentionally left at its empty default here
# — set your own "never block" domains in a gitignored sdkconfig.local
# instead of committing them, e.g.:
#   CONFIG_GENERATOR_ALLOWLIST="example.com,mybank.example"
